#+TITLE: September 21, 2017 - October 4, 2017
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE                                                          | CANCELED |
|------+------+-------------+---------+---------------------------------------------------------------+----------|
|      |      |             |         | read.1506395939. Review existing Python static  (2017-10-04)  |          |
|      |      |             |         | write.1506395986. Use cases for Python XML-RPC W (2017-10-04) |          |
|      |      |             |         | READ.1506395842. Read on Kubernetes Part I (2017-10-04)       |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME      | ESTIMATED |             ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|-----------+-----------+--------------------+------+-----------+--------------+------------|
| Bhavin192 |      10.0 |               2.03 | 10.0 |         0 |   2017-10-05 | ########## |
| Ashwanig  |      20.0 | 14.149999999999999 | 20.0 |         0 |   2017-10-05 | ########## |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  30 +---------------------------------------------------------------------+   
:     |    .....                                                       #    |   
:     |         ....                                         ACTUAL ####### |   
:  25 |+            .                                         IDEAL .......+|   
:     |              .....                                              #   |   
:     |                   ....                                          #   |   
:  20 |+                      .                                          # +|   
:     |                        .....                                     #  |   
:     |                             .....                                #  |   
:  15 |+                                 .....                            #+|   
:     |                                       .....                       # |   
:     |                                            ....                   # |   
:  10 |+                                               .                  #+|   
:     |                                                 .....              #|   
:     |                                                      ....          #|   
:   5 |+                                                         .         #|   
:     |                                                           .....    #|   
:     |                                                                .....|   
:   0 +---------------------------------------------------------------------+   
:     0         2         4         6         8         10        12        14  
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:14]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED                                  |
|-----+------------+--------+-------+--------------------------------------------------|
|   1 | 2017-09-21 |   30.0 |    28 |                                                  |
|   2 | 2017-09-22 |   30.0 |    26 |                                                  |
|   3 | 2017-09-23 |   30.0 |    24 |                                                  |
|   4 | 2017-09-24 |   30.0 |    21 |                                                  |
|   5 | 2017-09-25 |   30.0 |    19 |                                                  |
|   6 | 2017-09-26 |   30.0 |    17 |                                                  |
|   7 | 2017-09-27 |   30.0 |    15 |                                                  |
|   8 | 2017-09-28 |   30.0 |    13 |                                                  |
|   9 | 2017-09-29 |   30.0 |    11 |                                                  |
|  10 | 2017-09-30 |   30.0 |     9 |                                                  |
|  11 | 2017-10-01 |   30.0 |     6 |                                                  |
|  12 | 2017-10-02 |   30.0 |     4 |                                                  |
|  13 | 2017-10-03 |   30.0 |     2 |                                                  |
|  14 | 2017-10-04 |    0.0 |     0 | READ.1506395842 write.1506395986 read.1506395939 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                          | TASKID           | OWNER     | PRIORITY | TODO | ESTIMATED | ACTUAL |
|-----------------------------------------------+------------------+-----------+----------+------+-----------+--------|
| TASKS                                         |                  |           | B        |      |      30.0 |  16.18 |
|-----------------------------------------------+------------------+-----------+----------+------+-----------+--------|
| Review existing Python static site generators | read.1506395939  | ashwanig  | B        | DONE |      15.0 |  12.37 |
|-----------------------------------------------+------------------+-----------+----------+------+-----------+--------|
| Use cases for Python XML-RPC Wordpress plugin | write.1506395986 | ashwanig  | B        | DONE |       5.0 |   1.78 |
|-----------------------------------------------+------------------+-----------+----------+------+-----------+--------|
| Read on Kubernetes Part I                     | READ.1506395842  | bhavin192 | B        | DONE |      10.0 |   2.03 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 14
  :SPRINTSTART: <2017-09-21 Thu>
  :wpd-ashwanig: 6
  :wpd-bhavin192: 1
  :END:
** DONE Review existing Python static site generators
   CLOSED: [2017-10-04 Wed 20:41]
   :PROPERTIES:
   :ESTIMATED: 15.0
   :ACTUAL:   12.37
   :OWNER: ashwanig
   :ID: read.1506395939
   :TASKID: read.1506395939
   :END:
   :LOGBOOK:
   CLOCK: [2017-10-02 Mon 11:00]--[2017-10-02 Mon 12:24] =>  1:24
   CLOCK: [2017-10-01 Sun 15:11]--[2017-10-01 Sun 16:02] =>  0:51
   CLOCK: [2017-09-30 Sat 11:00]--[2017-09-30 Sat 12:24] =>  1:24
   CLOCK: [2017-09-29 Fri 11:00]--[2017-09-29 Fri 11:40] =>  0:40
   CLOCK: [2017-09-28 Thu 19:40]--[2017-09-28 Thu 21:03] =>  1:23
   CLOCK: [2017-09-28 Thu 10:00]--[2017-09-28 Thu 11:00] =>  1:00
   CLOCK: [2017-09-27 Wed 11:21]--[2017-09-27 Wed 13:30] =>  2:09
   CLOCK: [2017-09-26 Tue 21:00]--[2017-09-26 Tue 22:36] =>  1:36
   CLOCK: [2017-09-26 Tue 12:30]--[2017-09-26 Tue 13:17] =>  0:47
   CLOCK: [2017-09-26 Tue 11:00]--[2017-09-26 Tue 12:08] =>  1:08
   CLOCK: [2017-09-25 Mon 23:00]--[2017-09-25 Mon 23:00] =>  0:30
   :END:

** DONE Use cases for Python XML-RPC Wordpress plugin
   CLOSED: [2017-10-04 Wed 20:41]
   :PROPERTIES:
   :ESTIMATED: 5.0
   :ACTUAL:   1.78
   :OWNER: ashwanig
   :ID: write.1506395986
   :TASKID: write.1506395986
   :END:
   :LOGBOOK:
   CLOCK: [2017-10-04 Wed 10:30]--[2017-10-04 Wed 12:17] =>  1:47
   :END:
** DONE Read on Kubernetes Part I
   CLOSED: [2017-10-04 Wed 22:00]
   :PROPERTIES:
   :ESTIMATED: 10.0
   :ACTUAL:   2.03
   :OWNER: bhavin192
   :ID: READ.1506395842
   :TASKID: READ.1506395842
   :END:
   :LOGBOOK:
   CLOCK: [2017-09-30 Sat 16:30]--[2017-09-30 Sat 17:08] =>  0:38
   
   CLOCK: [2017-09-27 Wed 20:00]--[2017-09-27 Wed 20:34] =>  0:34
   CLOCK: [2017-09-27 Wed 19:25]--[2017-09-27 Wed 19:40] =>  0:15
   CLOCK: [2017-09-27 Wed 19:00]--[2017-09-27 Wed 19:10] =>  0:10
   CLOCK: [2017-09-27 Wed 16:30]--[2017-09-27 Wed 16:40] =>  0:10

   CLOCK: [2017-09-26 Tue 19:10]--[2017-09-26 Tue 19:25] =>  0:15
   :END:
